       IDENTIFICATION DIVISION.
       PROGRAM-ID. ITCOBOLC.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ENPTFILE ASSIGN TO WORKSTATION-ITCOBOLD
              ORGANIZATION IS TRANSACTION
              ACCESS MODE IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  ENPTFILE.
       01  ENPT-RECORD.
           COPY DDS-ALL-FORMATS OF ITCOBOLD.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           INITIALIZE ITCOBOLD-RECORD.
           OPEN I-O ENPTFILE.
           WRITE ENPT-RECORD FORMAT IS "MAIN".
           READ ENPTFILE.
           DISPLAY "ITCOBOLC ENPTUI INPUT RECEIVED".
           CLOSE ENPTFILE.
           STOP RUN.
