     A* ENPTUI GRID DEFINE, CLEAR AND REDRAW VALIDATION
     A                                      DSPSIZ(24 80 *DS3)
     A                                      CA03(03 'Exit')
     A                                      CF05(05 'Clear grid')
     A                                      CF06(06 'Redraw grid')
     A          R GRIDCLR                   GRDRCD
     A                                      GRDCLR
     A          R GRIDON                    GRDRCD
     A                                      GRDATR((*COLOR BLU) +
     A                                      (*LINTYP SLD))
     A                                      GRDBOX((*POS (4 4 15 72)) +
     A                                      (*TYPE PLAIN))
     A                                      GRDLIN((*POS (7 4 72)) +
     A                                      (*TYPE LOWER) (*COLOR WHT))
     A                                      GRDLIN((*POS (10 4 72)) +
     A                                      (*TYPE LOWER) (*COLOR WHT))
     A                                      GRDLIN((*POS (13 4 72)) +
     A                                      (*TYPE LOWER) (*COLOR WHT))
     A                                      GRDLIN((*POS (16 4 72)) +
     A                                      (*TYPE LOWER) (*COLOR WHT))
     A          R MAIN                      OVERLAY
     A                                  1  3'ENPTUI GRID VALIDATION'
     A                                      COLOR(WHT) DSPATR(HI)
     A                                  2  3'Grid lines are constructs.'
     A                                  5  6'Row 1'
     A                                  5 24'Alpha'
     A                                  5 50'100'
     A                                  8  6'Row 2'
     A                                  8 24'Beta'
     A                                  8 50'200'
     A                                 11  6'Row 3'
     A                                 11 24'Gamma'
     A                                 11 50'300'
     A                                 14  6'Row 4'
     A                                 14 24'Delta'
     A                                 14 50'400'
     A                                 18  6'Row 5'
     A                                 18 24'Epsilon'
     A                                 18 50'500'
     A                                 21  3'State:'
     A            RESULT        30A  O 21 11COLOR(TRQ)
     A                                 23  3'F3=Exit F5=Clear F6=Redraw'
