     A*************************************************************           
     A**                                                                      
     A** «»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«» 
     A** «» FlyByNight Software         AS/400 Technical Specialists       «» 
     A** «» Eclipse the competition - run your business on an IBM AS/400.  «» 
     A** «»                                                                «» 
     A** «» Phone: +61 3 9419 0175      Mobile: +61 0411 091 400           «» 
     A** «» Fax:   +61 3 9419 0175      mailto: shc@flybynight.com.au      «» 
     A** «»                                                                «» 
     A** «»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«»«» 
     A**                                                                      
     A** This program started as a copy of Simon's Clock Program **           
     A**  I appreciate his knowledge and have used it, but if    **           
     A**  anything does not run right, that's me, not him.       **           
     A**                   Booth Martin 2/00 Booth@MartinVT.com  **           
     A**                                                         **           
     A*************************************************************           
     A                                      DSPSIZ(24 80 *DS3)        
     A          R RFIGLET                                             
     A                                      CF03(03 'EXIT')           
     A                                      CF06(06 'SYSOP Messages') 
     A                                      CF08(08 'Settings')       
     A                                      BLINK                     
     A                                      OVERLAY                   
     A                                      WINDOW(2 6 9 65 *NOMSGLIN)
     A                                      WDWBORDER((*COLOR WHT))   
     A                                      WDWTITLE((*TEXT &TITLE;))  
     A  11                              2  1'   _    '                
     A  11                              3  1'  / |   '                
     A  11                              4  1'  | |   '                
     A  11                              5  1'  | |   '                
     A  11                              6  1'  |_|   '                
     A  12                              2  1' ____   '                
     A  12                              3  1'|___ \  '                
     A  12                              4  1'  __) | '                
     A  12                              5  1' / __/  '                
     A  12                              6  1'|_____| '       
     A  21                              2 10'   _    '       
     A  21                              3 10'  / |   '       
     A  21                              4 10'  | |   '       
     A  21                              5 10'  | |   '       
     A  21                              6 10'  |_|   '       
     A  22                              2 10' ____   '       
     A  22                              3 10'|___ \  '       
     A  22                              4 10'  __) | '       
     A  22                              5 10' / __/  '       
     A  22                              6 10'|_____| '       
     A  23                              2 10' _____  '       
     A  23                              3 10'|___ /  '       
     A  23                              4 10'  |_ \  '       
     A  23                              5 10' ___) | '       
     A  23                              6 10'|____/  '       
     A  24                              2 10' _  _   '       
     A  24                              3 10'| || |  '       
     A  24                              4 10'| || |_ '       
     A  24                              5 10'|__   _|'       
     A  24                              6 10'   |_|  '  
     A  25                              2 10' ____   '  
     A  25                              3 10'| ___|  '  
     A  25                              4 10'|___ \  '  
     A  25                              5 10' ___) | '  
     A  25                              6 10'|____/  '  
     A  26                              2 10'  __    '  
     A  26                              3 10' / /_   '  
     A  26                              4 10'|  _ \  '  
     A  26                              5 10'| (_) | '  
     A  26                              6 10' \___/  '  
     A  27                              2 10' _____  '  
     A  27                              3 10'|___  | '  
     A  27                              4 10'   / /  '  
     A  27                              5 10'  / /   '  
     A  27                              6 10' /_/    '  
     A  28                              2 10'  ___   '  
     A  28                              3 10' ( _ )  '  
     A  28                              4 10' / _ \  '  
     A  28                              5 10'| (_) | '  
     A  28                              6 10' \___/  '  
     A  29                              2 10'  ___   '  
     A  29                              3 10' / _ \  '  
     A  29                              4 10'| (_) | '  
     A  29                              5 10' \__, | '  
     A  29                              6 10'   /_/  '  
     A  20                              2 10'  ___   '  
     A  20                              3 10' / _ \  '  
     A  20                              4 10'| | | | '  
     A  20                              5 10'| |_| | '  
     A  20                              6 10' \___/  '  
     A  31                              2 25'   _    '  
     A  31                              3 25'  / |   '  
     A  31                              4 25'  | |   '  
     A  31                              5 25'  | |   '  
     A  31                              6 25'  |_|   '  
     A  32                              2 25' ____   '  
     A  32                              3 25'|___ \  '  
     A  32                              4 25'  __) | '  
     A  32                              5 25' / __/  '  
     A  32                              6 25'|_____| '   
     A  33                              2 25' _____  '   
     A  33                              3 25'|___ /  '   
     A  33                              4 25'  |_ \  '   
     A  33                              5 25' ___) | '   
     A  33                              6 25'|____/  '   
     A  34                              2 25' _  _   '   
     A  34                              3 25'| || |  '   
     A  34                              4 25'| || |_ '   
     A  34                              5 25'|__   _|'   
     A  34                              6 25'   |_|  '   
     A  35                              2 25' ____   '   
     A  35                              3 25'| ___|  '   
     A  35                              4 25'|___ \  '   
     A  35                              5 25' ___) | '   
     A  35                              6 25'|____/  '   
     A  36                              2 25'  __    '   
     A  36                              3 25' / /_   '   
     A  36                              4 25'|  _ \  '   
     A  36                              5 25'| (_) | '   
     A  36                              6 25' \___/  '  
     A  37                              2 25' _____  '  
     A  37                              3 25'|___  | '  
     A  37                              4 25'   / /  '  
     A  37                              5 25'  / /   '  
     A  37                              6 25' /_/    '  
     A  38                              2 25'  ___   '  
     A  38                              3 25' ( _ )  '  
     A  38                              4 25' / _ \  '  
     A  38                              5 25'| (_) | '  
     A  38                              6 25' \___/  '  
     A  39                              2 25'  ___   '  
     A  39                              3 25' / _ \  '  
     A  39                              4 25'| (_) | '  
     A  39                              5 25' \__, | '  
     A  39                              6 25'   /_/  '  
     A  30                              2 25'  ___   '  
     A  30                              3 25' / _ \  '  
     A  30                              4 25'| | | | '  
     A  30                              5 25'| |_| | '  
     A  30                              6 25' \___/  '    
     A  41                              2 34'   _    '    
     A  41                              3 34'  / |   '    
     A  41                              4 34'  | |   '    
     A  41                              5 34'  | |   '    
     A  41                              6 34'  |_|   '    
     A  42                              2 34' ____   '    
     A  42                              3 34'|___ \  '    
     A  42                              4 34'  __) | '    
     A  42                              5 34' / __/  '    
     A  42                              6 34'|_____| '    
     A  43                              2 34' _____  '    
     A  43                              3 34'|___ /  '    
     A  43                              4 34'  |_ \  '    
     A  43                              5 34' ___) | '    
     A  43                              6 34'|____/  '    
     A  44                              2 34' _  _   '    
     A  44                              3 34'| || |  '    
     A  44                              4 34'| || |_ '    
     A  44                              5 34'|__   _|'    
     A  44                              6 34'   |_|  '    
     A  45                              2 34' ____   '    
     A  45                              3 34'| ___|  '    
     A  45                              4 34'|___ \  '    
     A  45                              5 34' ___) | '    
     A  45                              6 34'|____/  '    
     A  46                              2 34'  __    '    
     A  46                              3 34' / /_   '    
     A  46                              4 34'|  _ \  '    
     A  46                              5 34'| (_) | '    
     A  46                              6 34' \___/  '    
     A  47                              2 34' _____  '    
     A  47                              3 34'|___  | '    
     A  47                              4 34'   / /  '    
     A  47                              5 34'  / /   '    
     A  47                              6 34' /_/    '    
     A  48                              2 34'  ___   '    
     A  48                              3 34' ( _ )  '    
     A  48                              4 34' / _ \  '    
     A  48                              5 34'| (_) | '    
     A  48                              6 34' \___/  '     
     A  49                              2 34'  ___   '     
     A  49                              3 34' / _ \  '     
     A  49                              4 34'| (_) | '     
     A  49                              5 34' \__, | '     
     A  49                              6 34'   /_/  '     
     A  40                              2 34'  ___   '     
     A  40                              3 34' / _ \  '     
     A  40                              4 34'| | | | '     
     A  40                              5 34'| |_| | '     
     A  40                              6 34' \___/  '     
     A  51                              2 49'   _    '     
     A  51                              3 49'  / |   '     
     A  51                              4 49'  | |   '     
     A  51                              5 49'  | |   '     
     A  51                              6 49'  |_|   '     
     A  52                              2 49' ____   '     
     A  52                              3 49'|___ \  '     
     A  52                              4 49'  __) | '     
     A  52                              5 49' / __/  '     
     A  52                              6 49'|_____| '   
     A  53                              2 49' _____  '   
     A  53                              3 49'|___ /  '   
     A  53                              4 49'  |_ \  '   
     A  53                              5 49' ___) | '   
     A  53                              6 49'|____/  '   
     A  54                              2 49' _  _   '   
     A  54                              3 49'| || |  '   
     A  54                              4 49'| || |_ '   
     A  54                              5 49'|__   _|'   
     A  54                              6 49'   |_|  '   
     A  55                              2 49' ____   '   
     A  55                              3 49'| ___|  '   
     A  55                              4 49'|___ \  '   
     A  55                              5 49' ___) | '   
     A  55                              6 49'|____/  '   
     A  56                              2 49'  __    '   
     A  56                              3 49' / /_   '   
     A  56                              4 49'|  _ \  '   
     A  56                              5 49'| (_) | '   
     A  56                              6 49' \___/  '    
     A  57                              2 49' _____  '    
     A  57                              3 49'|___  | '    
     A  57                              4 49'   / /  '    
     A  57                              5 49'  / /   '    
     A  57                              6 49' /_/    '    
     A  58                              2 49'  ___   '    
     A  58                              3 49' ( _ )  '    
     A  58                              4 49' / _ \  '    
     A  58                              5 49'| (_) | '    
     A  58                              6 49' \___/  '    
     A  59                              2 49'  ___   '    
     A  59                              3 49' / _ \  '    
     A  59                              4 49'| (_) | '    
     A  59                              5 49' \__, | '    
     A  59                              6 49'   /_/  '    
     A  50                              2 49'  ___   '    
     A  50                              3 49' / _ \  '    
     A  50                              4 49'| | | | '    
     A  50                              5 49'| |_| | '    
     A  50                              6 49' \___/  '      
     A  61                              2 58'   _    '      
     A  61                              3 58'  / |   '      
     A  61                              4 58'  | |   '      
     A  61                              5 58'  | |   '      
     A  61                              6 58'  |_|   '      
     A  62                              2 58' ____   '      
     A  62                              3 58'|___ \  '      
     A  62                              4 58'  __) | '      
     A  62                              5 58' / __/  '      
     A  62                              6 58'|_____| '      
     A  63                              2 58' _____  '      
     A  63                              3 58'|___ /  '      
     A  63                              4 58'  |_ \  '      
     A  63                              5 58' ___) | '      
     A  63                              6 58'|____/  '      
     A  64                              2 58' _  _   '      
     A  64                              3 58'| || |  '      
     A  64                              4 58'| || |_ '      
     A  64                              5 58'|__   _|'      
     A  64                              6 58'   |_|  '    
     A  65                              2 58' ____   '    
     A  65                              3 58'| ___|  '    
     A  65                              4 58'|___ \  '    
     A  65                              5 58' ___) | '    
     A  65                              6 58'|____/  '    
     A  66                              2 58'  __    '    
     A  66                              3 58' / /_   '    
     A  66                              4 58'|  _ \  '    
     A  66                              5 58'| (_) | '    
     A  66                              6 58' \___/  '    
     A  67                              2 58' _____  '    
     A  67                              3 58'|___  | '    
     A  67                              4 58'   / /  '    
     A  67                              5 58'  / /   '    
     A  67                              6 58' /_/    '    
     A  68                              2 58'  ___   '    
     A  68                              3 58' ( _ )  '    
     A  68                              4 58' / _ \  '    
     A  68                              5 58'| (_) | '    
     A  68                              6 58' \___/  '
     A  69                              2 58'  ___   '
     A  69                              3 58' / _ \  '
     A  69                              4 58'| (_) | '
     A  69                              5 58' \__, | '
     A  69                              6 58'   /_/  '
     A  60                              2 58'  ___   '
     A  60                              3 58' / _ \  '
     A  60                              4 58'| | | | '
     A  60                              5 58'| |_| | '
     A  60                              6 58' \___/  '
     A                                  3 20' _ '     
     A                                  4 20'(_)'     
     A                                  5 20' _ '     
     A                                  6 20'(_)'     
     A                                  3 44' _ '     
     A                                  4 44'(_)'     
     A                                  5 44' _ '     
     A                                  6 44'(_)'     
     A            TITLE         50   P                
     A            PB2            2Y 0B  9  1PSHBTNFLD((*GUTTER 1))        
     A                                      PSHBTNCHC(1 'M>essages' CF06) 
     A                                      PSHBTNCHC(2 'S>ettings' CF08) 
     A                                      PSHBTNCHC(3 'E>xit' CF03)     
     A            DOWEEK         9A  O  8 56COLOR(WHT)                    
     A            DAT            8A  O  9 57COLOR(WHT)                    
     A                                  8 49'Day:'                        
     A            JDAY           6A  O  9 49COLOR(WHT)                    
